/* eslint-disable */
console.log(`Самооценка
75/220
1. Страница с игрушками содержит карточки всех игрушек а также фильтры, строку поиска, поле для сортировки. Выполняются требования к вёрстке +10/10
2. Карточка игрушки содержит её изображение, название, текстом или условным значком обозначено количество экземпляров, год покупки, форма, цвет, размер, является ли игрушка любимой +10/10
Карточки игрушек добавляются динамически средствами JavaScript (на кросс-чеке этот пункт не проверяется)
3. Добавление игрушек в избранное +0/20
- - кликая по карточке с игрушкой или по кнопке на ней игрушку можно добавлять в избранное или удалять из избранного. Карточки добавленных в избранное игрушек внешне отличаются от остальных +10
- - на странице отображается количество добавленных в избранное игрушек. При попытке добавить в избранное больше 20 игрушек, выводится всплывающее уведомление с текстом "Извините, все слоты заполнены" +10
4. Сортировка +0/20
Сортируются только те игрушки, которые в данный момент отображаются на странице
- - сортировка игрушек по названию в возрастающем и спадающем порядке +0/10
- - сортировка игрушек по году их приобретения в возрастающем и спадающем порядке +0/10
5. Фильтры в указанном диапазоне от и до +10/30
- - фильтры по количеству экземпляров +0/10
- - фильтры по году покупки +0/10
- - для фильтрации в указанном диапазоне используется range slider с двумя ползунками. При перемещении ползунков отображается их текущее значение, разный цвет слайдера до и после ползунка +10/10
Range slider можно создать на основе input[type=range] - пример или использовать для этой цели библиотеку noUiSlider, или другую на ваш выбор
6. Фильтры по значению +15/30
Выбранные фильтры выделяются стилем.
- - фильтры по форме +5/5
- - фильтры по цвету +0/5
- - фильтры по размеру +0/5
- - можно отобразить только любимые игрушки +0/5
- - можно отфильтровать игрушки по нескольким фильтрам одного типа +10/10
Для нескольких фильтров одного типа отображаются игрушки, которые соответствуют хоть одному выбранному фильтру. Например, можно отобразить снежинки и колокольчики; или белые, синие и красные игрушки; или большие и средние.
7. Можно отфильтровать игрушки по нескольким фильтрам разного типа +0/20
Для нескольких фильтров разного типа отображаются только те игрушки, которые соответствуют всем выбранным фильтрам.
Например, можно отобразить только синие шары. Или любимые белые и красные игрушки купленные в 1940-1960 годах.
Если игрушек, соответствующих всем выбранным фильтрам нет, на странице выводится уведомление в человекочитаемом формате, например, "Извините, совпадений не обнаружено"
8. Сброс фильтров +0/20
- - есть кнопка reset для сброса фильтров +0/10
Кнопка reset сбрасывает только фильтры, не влияя на порядок сортировки или игрушки, добавленные в избранное.
После использования кнопки reset фильтры остаются работоспособными
- - при сбросе фильтров кнопкой reset, ползунки range slider сдвигаются к краям, значения ползунков возвращаются к первоначальным, range slider закрашивается одним цветом +0/10
9. Сохранение настроек в local storage +0/10
- - выбранные пользователем фильтры, порядок сортировки, добавленные в избранное игрушки сохраняются при перезагрузке страницы. Есть кнопка сброса настроек, которая очищает local storage +0/10
10. Поиск +30/30
- - при открытии приложения курсор находится в поле поиска +2/2
- - автозаполнение поля поиска отключено (нет выпадающего списка с предыдущими запросами) +2/2
- - есть placeholder +2/2
- - в поле поиска есть крестик, позволяющий очистить поле поиска +2/2
- - если нет совпадения последовательности букв в поисковом запросе с названием игрушки, выводится уведомление в человекочитаемом формате, например "Извините, совпадений не обнаружено" +2/2
- - при вводе поискового запроса на странице остаются только те игрушки, в которых есть указанные в поиске буквы в указанном порядке. При этом не обязательно, чтобы буквы были в начале слова. Регистр символов при поиске не учитывается +10/10
Поиск ведётся только среди игрушек, которые в данный момент отображаются на странице.
если очистить поле поиска, на странице отображаются игрушки, соответствующие всем выбранным фильтрам и настройкам сортировки +10/10
11. Дополнительный функционал на выбор +0/20
- - в процессе сортировки, фильтрации, поиска карточки с изображениями игрушек плавно меняют своё положение +0/10
Код для плавного перемещения карточек можно написать самостоятельно - пример, или использовать для этой цели библиотеку, Демо 1, Демо 2. Библиотека может использоваться только для перемещения карточек, фильтрацию, сортировку и поиск вам необходимо написать полностью самостоятельно
- - очень высокое качество оформления приложения + дополнительный, не указанный в задании, сложный в реализации функционал, улучшающий качество приложения, удобство пользования им +0/10`);
/* eslint-enable */
